# Напишите программу, которая удаляет дубликаты элементов из списка.

strList = input("Введите строку: ")

print(list(strList))