# Даны два целых числа A и В.
# Выведите все числа от A до B включительно:
# в порядке возрастания, если A < B, или в порядке убывания если A > B

A = input("Введите целое число А = ")
B = input("Введите целое число B = ")

if A = B:
    print("A и B должны отличаться")
else:
    for i in range(A,B):
        print(i)